
from database import get_lock, set_lock

LOCKS = {
 "جمثون":"جمثون","السب":"السب","الايرانيه":"الايرانية","الكتابة":"الكتابة",
 "الاباحي":"الإباحي","تعديل الميديا":"تعديل الميديا","التعديل":"التعديل",
 "الفيديو":"الفيديو","الصور":"الصور","الملصقات":"الملصقات","المتحركة":"المتحركة",
 "الدردشة":"الدردشة","الروابط":"الروابط","التاك":"التاك","البوتات":"البوتات",
 "المعرفات":"المعرفات","الكلايش":"الكلايش","التكرار":"التكرار","التوجيه":"التوجيه",
 "الانلاين":"الانلاين","الجهات":"الجهات","الدخول":"الدخول","الصوت":"الصوت",
 "التوجيه بالتقييد":"التوجيه بالتقييد","الروابط بالتقييد":"الروابط بالتقييد",
 "المتحركة بالتقييد":"المتحركة بالتقييد","الصور بالتقييد":"الصور بالتقييد",
 "الفيديو بالتقييد":"الفيديو بالتقييد","البوتات بالطرد":"البوتات بالطرد"
}
FEATURES = ["ضافني","الاذكار","الثنائي","افتاري","التسلية","الكت","الترحيب","الردود",
"الانذار","التحذير","الايدي","الرابط","اطردني","الحظر","الرفع","التنزيل","التحويل",
"الحماية","المنشن","وضع الاقتباسات","الخدمية","اليوتيوب","الايدي بالصورة","التحقق","ردود السورس"]

def lock_key(name):
    return LOCKS.get(name,name)

def set_mode(chat,name,mode):
    set_lock(chat,lock_key(name),mode)

def mode(chat,name):
    return get_lock(chat,lock_key(name))
